JuhoL/ASch/Hal_STM32F429ZI/mocks/stm32f429xx_mock.cpp
//-----------------------------------------------------------------------------------------------------------------------------
// Copyright (c) 2019 Juho Lepistö
// 
// Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated
// documentation files (the "Software"), to deal in the Software without restriction, including without 
// limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
// the Software, and to permit persons to whom the Software is furnished to do so, subject to the following
// conditions:
//
// The above copyright notice and this permission notice shall be included in all copies or substantial
// portions of the Software.
// 
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED
// TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL
// THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF
// CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
// IN THE SOFTWARE.
//-----------------------------------------------------------------------------------------------------------------------------

//! @file    stm32f429xx_mock.cpp
//! @author  Juho Lepistö <juho.lepisto(a)gmail.com>
//! @date    23 Jun 2019
//!
//! @brief   Mocks for STM32F429xx.
//! 
//! These is mock of STM32F429xx registers. The file is based on ST original MCU header stm32f429xx.h
    
//-----------------------------------------------------------------------------------------------------------------------------
// 1. Include Files
//-----------------------------------------------------------------------------------------------------------------------------

#include <stm32f429xx_mock.h>

//-----------------------------------------------------------------------------------------------------------------------------
// 2. Mock Structs
//-----------------------------------------------------------------------------------------------------------------------------

namespace Hal_Mock
{

TIM_TypeDef timers[timersMax];
RTC_TypeDef rtc;
WWDG_TypeDef wwdg;
IWDG_TypeDef iwdg;
SPI_TypeDef spis[spisMax];
USART_TypeDef usarts[usartsMax];
I2C_TypeDef i2cs[i2csMax];
CAN_TypeDef cans[cansMax];
PWR_TypeDef pwr;
DAC_TypeDef dac;
ADC_TypeDef adcs[adcsMax];
ADC_Common_TypeDef adcCommon;
SDIO_TypeDef sdio;
SYSCFG_TypeDef sysCfg;
EXTI_TypeDef exti;
SAI_Block_TypeDef sais[saisMax];
LTDC_TypeDef ltdc;
LTDC_Layer_TypeDef ltdcLayers[ltdcLayersMax];
GPIO_TypeDef gpios[gpiosMax];
CRC_TypeDef crc;
RCC_TypeDef rcc;
FLASH_TypeDef flash;
DMA_TypeDef dmas[dmasMax];
DMA_Stream_TypeDef dmaStreams[dmaStreamsMax];
ETH_TypeDef eth;
DMA2D_TypeDef dma2d;
DCMI_TypeDef dcmi;
RNG_TypeDef rng;
FMC_Bank1_TypeDef fmcBank1;
FMC_Bank1E_TypeDef fmcBank1E;
FMC_Bank2_3_TypeDef fmcBank2_3;
FMC_Bank4_TypeDef fmcBank4;
FMC_Bank5_6_TypeDef fmcBank5_6;
DBGMCU_TypeDef dbgMcu;
USB_OTG_GlobalTypeDef usbs[usbsMax];

SCnSCB_Type scnScb;
SCB_Type scb;
SysTick_Type sysTick;
NVIC_Type nvic;
ITM_Type itm;
DWT_Type dwt;
TPI_Type tpi;
CoreDebug_Type coreDebug;
MPU_Type mpu;
FPU_Type fpu;

void InitRegisters(void)
{
    InitTimerRegisters();
    InitRtcRegisters();
    InitWwdgRegisters();
    InitIwdgRegisters();
    InitSpiRegisters();
    InitUsartRegisters();
    InitI2cRegisters();
    InitCanRegisters();
    InitPwrRegisters();
    InitDacRegisters();
    InitAdcRegisters();
    InitSdioRegisters();
    InitSysCfgRegisters();
    InitExtiRegisters();
    InitSaiRegisters();
    InitLtdcRegisters();
    InitGpioRegisters();
    InitCrcRegisters();
    InitRccRegisters();
    InitFlashRegisters();
    InitDmaRegisters();
    InitEthRegisters();
    InitDma2dRegisters();
    InitDcmiRegisters();
    InitRngRegisters();
    InitFmcRegisters();
    InitDbgMcuRegisters();
    InitUsbRegisters();

    InitScnScbRegisters();
    InitScbRegisters();
    InitSysTickRegisters();
    InitNvicRegisters();
    InitItmRegisters();
    InitDwtRegisters();
    InitTpiRegisters();
    InitCoreDebugRegisters();
    InitMpuRegisters();
    InitFpuRegisters();

    return;
}

void InitTimerRegisters(void)
{
    for (uint32_t i = 0UL; i < timersMax; ++i)
    {
        timers[i].CR1   = 0x0UL;
        timers[i].CR2   = 0x0UL;
        timers[i].SMCR  = 0x0UL;
        timers[i].DIER  = 0x0UL;
        timers[i].SR    = 0x0UL;
        timers[i].EGR   = 0x0UL;
        timers[i].CCMR1 = 0x0UL;
        timers[i].CCMR2 = 0x0UL;
        timers[i].CCER  = 0x0UL;
        timers[i].CNT   = 0x0UL;
        timers[i].PSC   = 0x0UL;
        timers[i].ARR   = 0xFFFFUL;
        timers[i].RCR   = 0x0UL;
        timers[i].CCR1  = 0x0UL;
        timers[i].CCR2  = 0x0UL;
        timers[i].CCR3  = 0x0UL;
        timers[i].CCR4  = 0x0UL;
        timers[i].BDTR  = 0x0UL;
        timers[i].DCR   = 0x0UL;
        timers[i].DMAR  = 0x0UL;
        timers[i].OR    = 0x0UL;
    }
    return;
}

void InitRtcRegisters(void)
{
    rtc.TR          = 0x0UL;
    rtc.DR          = 0x2101UL;
    rtc.CR          = 0x0UL;
    rtc.ISR         = 0x7UL;
    rtc.PRER        = 0x7F00FFUL;
    rtc.WUTR        = 0xFFFFUL;
    rtc.CALIBR      = 0x0UL;
    rtc.ALRMAR      = 0x0UL;
    rtc.ALRMBR      = 0x0UL;
    rtc.WPR         = 0x0UL;
    rtc.SSR         = 0x0UL;
    rtc.SHIFTR      = 0x0UL;
    rtc.TSTR        = 0x0UL;
    rtc.TSDR        = 0x0UL;
    rtc.TSSSR       = 0x0UL;
    rtc.CALR        = 0x0UL;
    rtc.TAFCR       = 0x0UL;
    rtc.ALRMASSR    = 0x0UL;
    rtc.ALRMBSSR    = 0x0UL;
    rtc.RESERVED7   = 0x0UL;
    rtc.BKP0R       = 0x0UL;
    rtc.BKP1R       = 0x0UL;
    rtc.BKP2R       = 0x0UL;
    rtc.BKP3R       = 0x0UL;
    rtc.BKP4R       = 0x0UL;
    rtc.BKP5R       = 0x0UL;
    rtc.BKP6R       = 0x0UL;
    rtc.BKP7R       = 0x0UL;
    rtc.BKP8R       = 0x0UL;
    rtc.BKP9R       = 0x0UL;
    rtc.BKP10R      = 0x0UL;
    rtc.BKP11R      = 0x0UL;
    rtc.BKP12R      = 0x0UL;
    rtc.BKP13R      = 0x0UL;
    rtc.BKP14R      = 0x0UL;
    rtc.BKP15R      = 0x0UL;
    rtc.BKP16R      = 0x0UL;
    rtc.BKP17R      = 0x0UL;
    rtc.BKP18R      = 0x0UL;
    rtc.BKP19R      = 0x0UL;
    return;
}

