JuhoL/ASch/Hal_STM32F429ZI/mocks/stm32f429xx_mock.cpp
void InitWwdgRegisters(void)
{
    wwdg.CR     = 0x7FUL;
    wwdg.CFR    = 0x7FUL;
    wwdg.SR     = 0x0UL;
    return;
}

void InitIwdgRegisters(void)
{
    iwdg.KR     = 0x0UL;
    iwdg.PR     = 0x0UL;
    iwdg.RLR    = 0xFFFUL;
    iwdg.SR     = 0x0UL;
    return;
}

void InitSpiRegisters(void)
{
    for (uint32_t i = 0UL; i < spisMax; ++i)
    {
        spis[i].CR1     = 0x0UL;
        spis[i].CR2     = 0x0UL;
        spis[i].SR      = 0x2UL;
        spis[i].DR      = 0x0UL;
        spis[i].CRCPR   = 0x7UL;
        spis[i].RXCRCR  = 0x0UL;
        spis[i].TXCRCR  = 0x0UL;
        spis[i].I2SCFGR = 0x0UL;
        spis[i].I2SPR   = 0x2UL;
    }
    return;
}

void InitUsartRegisters(void)
{
    for (uint32_t i = 0UL; i < usartsMax; ++i)
    {
        usarts[i].SR    = 0xC0UL;
        usarts[i].DR    = 0x0UL;
        usarts[i].BRR   = 0x0UL;
        usarts[i].CR1   = 0x0UL;
        usarts[i].CR2   = 0x0UL;
        usarts[i].CR3   = 0x0UL;
        usarts[i].GTPR  = 0x0UL;
    }
    return;
}

void InitI2cRegisters(void)
{
    for (uint32_t i = 0UL; i < i2csMax; ++i)
    {
        i2cs[i].CR1     = 0x0UL;
        i2cs[i].CR2     = 0x0UL;
        i2cs[i].OAR1    = 0x0UL;
        i2cs[i].OAR2    = 0x0UL;
        i2cs[i].DR      = 0x0UL;
        i2cs[i].SR1     = 0x0UL;
        i2cs[i].SR2     = 0x0UL;
        i2cs[i].CCR     = 0x0UL;
        i2cs[i].TRISE   = 0x2UL;
        i2cs[i].FLTR    = 0x0UL;
    }
    return;
}

void InitCanRegisters(void)
{
    for (uint32_t i = 0UL; i < cansMax; ++i)
    {
        cans[i].MCR             = 0x10002UL;
        cans[i].MSR             = 0xC02UL;
        cans[i].TSR             = 0x1C000000UL;
        cans[i].RF0R            = 0x0UL;
        cans[i].RF1R            = 0x0UL;
        cans[i].IER             = 0x0UL;
        cans[i].ESR             = 0x0UL;
        cans[i].BTR             = 0x1230000UL;
        for (uint32_t k = 0UL; k < 88UL; ++k)
        {
            cans[i].RESERVED0[k] = 0x0UL;
        }
        for (uint32_t k = 0UL; k < 3UL; ++k)
        {
            cans[i].sTxMailBox[k].TIR  = 0x0UL;
            cans[i].sTxMailBox[k].TDTR = 0x0UL;
            cans[i].sTxMailBox[k].TDLR = 0x0UL;
            cans[i].sTxMailBox[k].TDHR = 0x0UL;
        }
        for (uint32_t k = 0UL; k < 2UL; ++k)
        {
            cans[i].sFIFOMailBox[k].RIR     = 0x0UL;
            cans[i].sFIFOMailBox[k].RDTR    = 0x0UL;
            cans[i].sFIFOMailBox[k].RDLR    = 0x0UL;
            cans[i].sFIFOMailBox[k].RDHR    = 0x0UL;
        }
        for (uint32_t k = 0UL; k < 12UL; ++k)
        {
            cans[i].RESERVED1[k] = 0x0UL;
        }
        cans[i].FMR             = 0x2A1C0E01UL;
        cans[i].FM1R            = 0x0UL;
        cans[i].RESERVED2       = 0x0UL;
        cans[i].FS1R            = 0x0UL;
        cans[i].RESERVED3       = 0x0UL;
        cans[i].FFA1R           = 0x0UL;
        cans[i].RESERVED4       = 0x0UL;
        cans[i].FA1R            = 0x0UL;
        for (uint32_t k = 0UL; k < 8UL; ++k)
        {
            cans[i].RESERVED5[k] = 0x0UL;
        }
        for (uint32_t k = 0UL; k < 28UL; ++k)
        {
            cans[i].sFilterRegister[k].FR1 = 0x0UL;
            cans[i].sFilterRegister[k].FR2 = 0x0UL;
        }
    }
    return;
}

void InitPwrRegisters(void)
{
    pwr.CR  = 0xC000UL;
    pwr.CSR = 0x0UL;
    return;
}

void InitDacRegisters(void)
{
    dac.CR      = 0x0UL;
    dac.SWTRIGR = 0x0UL;
    dac.DHR12R1 = 0x0UL;
    dac.DHR12L1 = 0x0UL;
    dac.DHR8R1  = 0x0UL;
    dac.DHR12R2 = 0x0UL;
    dac.DHR12L2 = 0x0UL;
    dac.DHR8R2  = 0x0UL;
    dac.DHR12RD = 0x0UL;
    dac.DHR12LD = 0x0UL;
    dac.DHR8RD  = 0x0UL;
    dac.DOR1    = 0x0UL;
    dac.DOR2    = 0x0UL;
    dac.SR      = 0x0UL;
    return;
}

void InitAdcRegisters(void)
{
    for (uint32_t i = 0UL; i < adcsMax; ++i)
    {
        adcs[i].SR      = 0x0UL;
        adcs[i].CR1     = 0x0UL;
        adcs[i].CR2     = 0x0UL;
        adcs[i].SMPR1   = 0x0UL;
        adcs[i].SMPR2   = 0x0UL;
        adcs[i].JOFR1   = 0x0UL;
        adcs[i].JOFR2   = 0x0UL;
        adcs[i].JOFR3   = 0x0UL;
        adcs[i].JOFR4   = 0x0UL;
        adcs[i].HTR     = 0xFFFUL;
        adcs[i].LTR     = 0x0UL;
        adcs[i].SQR1    = 0x0UL;
        adcs[i].SQR2    = 0x0UL;
        adcs[i].SQR3    = 0x0UL;
        adcs[i].JSQR    = 0x0UL;
        adcs[i].JDR1    = 0x0UL;
        adcs[i].JDR2    = 0x0UL;
        adcs[i].JDR3    = 0x0UL;
        adcs[i].JDR4    = 0x0UL;
        adcs[i].DR      = 0x0UL;
    }
    adcCommon.CSR = 0x0UL;
    adcCommon.CCR = 0x0UL;
    adcCommon.CDR = 0x0UL;
    return;
}

void InitSdioRegisters(void)
{
    sdio.POWER      = 0x0UL;
    sdio.CLKCR      = 0x0UL;
    sdio.ARG        = 0x0UL;
    sdio.CMD        = 0x0UL;
    sdio.RESPCMD    = 0x0UL;
    sdio.RESP1      = 0x0UL;
    sdio.RESP2      = 0x0UL;
    sdio.RESP3      = 0x0UL;
    sdio.RESP4      = 0x0UL;
    sdio.DTIMER     = 0x0UL;
    sdio.DLEN       = 0x0UL;
    sdio.DCTRL      = 0x0UL;
    sdio.DCOUNT     = 0x0UL;
    sdio.STA        = 0x0UL;
    sdio.ICR        = 0x0UL;
    sdio.MASK       = 0x0UL;
    for (uint32_t k = 0UL; k < 2UL; ++k)
    {
        sdio.RESERVED0[k] = 0x0UL;
    }
    sdio.FIFOCNT    = 0x0UL;
    for (uint32_t k = 0UL; k < 13UL; ++k)
    {
        sdio.RESERVED1[k] = 0x0UL;
    }
    sdio.FIFO       = 0x0UL;
    return;
}

void InitSysCfgRegisters(void)
{
    sysCfg.MEMRMP   = 0x0UL;
    sysCfg.PMC      = 0x0UL;
    for (uint32_t k = 0UL; k < 4UL; ++k)
    {
        sysCfg.EXTICR[k] = 0x0UL;
    }
    for (uint32_t k = 0UL; k < 2UL; ++k)
    {
        sysCfg.RESERVED[k] = 0x0UL;
    }
    sysCfg.CMPCR    = 0x0UL;
    return;
}

void InitExtiRegisters(void)
{
    exti.IMR    = 0x0UL;
    exti.EMR    = 0x0UL;
    exti.RTSR   = 0x0UL;
    exti.FTSR   = 0x0UL;
    exti.SWIER  = 0x0UL;
    exti.PR     = 0x0UL;
    return;
}

void InitSaiRegisters(void)
{
    for (uint32_t i = 0UL; i < saisMax; ++i)
    {
        sais[i].CR1     = 0x40UL;
        sais[i].CR2     = 0x0UL;
        sais[i].FRCR    = 0x7UL;
        sais[i].SLOTR   = 0x0UL;
        sais[i].IMR     = 0x0UL;
        sais[i].SR      = 0x8UL;
        sais[i].CLRFR   = 0x0UL;
        sais[i].DR      = 0x0UL;
    }
    return;
}

void InitLtdcRegisters(void)
{
    for (uint32_t k = 0UL; k < 2UL; ++k)
    {
        ltdc.RESERVED0[k] = 0x0UL;
    }
    ltdc.SSCR       = 0x0UL;
    ltdc.BPCR       = 0x0UL;
    ltdc.AWCR       = 0x0UL;
    ltdc.TWCR       = 0x0UL;
    ltdc.GCR        = 0x2220UL;
    for (uint32_t k = 0UL; k < 2UL; ++k)
    {
        ltdc.RESERVED1[k] = 0x0UL;
    }
    ltdc.SRCR       = 0x0UL;
    ltdc.RESERVED2[0] = 0x0UL;
    ltdc.BCCR       = 0x0UL;
    ltdc.RESERVED3[0] = 0x0UL;
    ltdc.IER        = 0x0UL;
    ltdc.ISR        = 0x0UL;
    ltdc.ICR        = 0x0UL;
    ltdc.LIPCR      = 0x0UL;
    ltdc.CPSR       = 0x0UL;
    ltdc.CDSR       = 0xFUL;
    for (uint32_t i = 0UL; i < ltdcLayersMax; ++i)
    {
        ltdcLayers[i].CR        = 0x0UL;
        ltdcLayers[i].WHPCR     = 0x0UL;
        ltdcLayers[i].WVPCR     = 0x0UL;
        ltdcLayers[i].CKCR      = 0x0UL;
        ltdcLayers[i].PFCR      = 0x0UL;
        ltdcLayers[i].CACR      = 0xFFUL;
        ltdcLayers[i].DCCR      = 0x0UL;
        ltdcLayers[i].BFCR      = 0x607UL;
        for (uint32_t k = 0UL; k < 2UL; ++k)
        {
            ltdcLayers[i].RESERVED0[k] = 0x0UL;
        }
        ltdcLayers[i].CFBAR     = 0x0UL;
        ltdcLayers[i].CFBLR     = 0x0UL;
        ltdcLayers[i].CFBLNR    = 0x0UL;
        for (uint32_t k = 0UL; k < 3UL; ++k)
        {
            ltdcLayers[i].RESERVED1[k] = 0x0UL;
        }
        ltdcLayers[i].CLUTWR    = 0x0UL;
    }
    return;
}

void InitGpioRegisters(void)
{
    for (uint32_t i = 0UL; i < gpiosMax; ++i)
    {
        if (i == 0UL)
        {
            gpios[i].MODER   = 0xA8000000UL;
            gpios[i].OSPEEDR = 0x0C000000UL;
            gpios[i].PUPDR   = 0x64000000UL;
        }
        else if (i == 1UL)
        {
            gpios[i].MODER   = 0x280UL;
            gpios[i].OSPEEDR = 0x0C0UL;
            gpios[i].PUPDR   = 0x100UL;
        }
        else
        {
            gpios[i].MODER   = 0x0UL;
            gpios[i].OSPEEDR = 0x0UL;
            gpios[i].PUPDR   = 0x0UL;
        }
        gpios[i].OTYPER  = 0x0UL;
        gpios[i].PUPDR   = 0x0UL;
        gpios[i].IDR     = 0x0UL;
        gpios[i].ODR     = 0x0UL;
        gpios[i].BSRR    = 0x0UL;
        gpios[i].LCKR    = 0x0UL;
        for (uint32_t k = 0UL; k < 2UL; ++k)
        {
            gpios[i].AFR[k] = 0x0UL;
        }
    }
    return;
}

void InitCrcRegisters(void)
{
    crc.DR          = 0xFFFFFFFFUL;
    crc.IDR         = 0x0UL;
    crc.RESERVED0   = 0x0UL;
    crc.RESERVED1   = 0x0UL;
    crc.CR          = 0x0UL;
    return;
}

