JuhoL/ASch/Hal_STM32F429ZI/mocks/stm32f429xx_mock.cpp
void InitRccRegisters(void)
{
    rcc.CR          = 0x83UL;
    rcc.PLLCFGR     = 0x24003010UL;
    rcc.CFGR        = 0x0UL;
    rcc.CIR         = 0x0UL;
    rcc.AHB1RSTR    = 0x0UL;
    rcc.AHB2RSTR    = 0x0UL;
    rcc.AHB3RSTR    = 0x0UL;
    rcc.RESERVED0   = 0x0UL;
    rcc.APB1RSTR    = 0x0UL;
    rcc.APB2RSTR    = 0x0UL;
    for (uint32_t k = 0UL; k < 2UL; ++k)
    {
        rcc.RESERVED1[k] = 0x0UL;
    }
    rcc.AHB1ENR     = 0x100000UL;
    rcc.AHB2ENR     = 0x0UL;
    rcc.AHB3ENR     = 0x0UL;
    rcc.RESERVED2   = 0x0UL;
    rcc.APB1ENR     = 0x0UL;
    rcc.APB2ENR     = 0x0UL;
    for (uint32_t k = 0UL; k < 2UL; ++k)
    {
        rcc.RESERVED3[k] = 0x0UL;
    }
    rcc.AHB1LPENR   = 0x7EEF97FFUL;
    rcc.AHB2LPENR   = 0xF1UL;
    rcc.AHB3LPENR   = 0x1UL;
    rcc.RESERVED4   = 0x0UL;
    rcc.APB1LPENR   = 0xF6FEC9FFUL;
    rcc.APB2LPENR   = 0x4777F33UL;
    for (uint32_t k = 0UL; k < 2UL; ++k)
    {
        rcc.RESERVED5[k] = 0x0UL;
    }
    rcc.BDCR        = 0x0UL;
    rcc.CSR         = 0xE000000UL;
    for (uint32_t k = 0UL; k < 2UL; ++k)
    {
        rcc.RESERVED6[k] = 0x0UL;
    }
    rcc.SSCGR       = 0x0UL;
    rcc.PLLI2SCFGR  = 0x24003000UL;
    rcc.PLLSAICFGR  = 0x24003000UL;
    rcc.DCKCFGR     = 0x0UL;
    return;
}

void InitFlashRegisters(void)
{
    flash.ACR       = 0x0UL;
    flash.KEYR      = 0x0UL;
    flash.OPTKEYR   = 0x0UL;
    flash.SR        = 0x0UL;
    flash.CR        = 0x80000000UL;
    flash.OPTCR     = 0xFFFAAEDUL;
    flash.OPTCR1    = 0xFFF0000UL;
    return;
}

void InitDmaRegisters(void)
{
    for (uint32_t i = 0UL; i < dmasMax; ++i)
    {
        dmas[i].LISR    = 0x0UL;
        dmas[i].HISR    = 0x0UL;
        dmas[i].LIFCR   = 0x0UL;
        dmas[i].HIFCR   = 0x0UL;
    }
    for (uint32_t i = 0UL; i < dmaStreamsMax; ++i)
    {
        dmaStreams[i].CR    = 0x0UL;
        dmaStreams[i].NDTR  = 0x0UL;
        dmaStreams[i].PAR   = 0x0UL;
        dmaStreams[i].M0AR  = 0x0UL;
        dmaStreams[i].M1AR  = 0x0UL;
        dmaStreams[i].FCR   = 0x21UL;
    }
    return;
}

void InitEthRegisters(void)
{
    eth.MACCR       = 0x8000UL;
    eth.MACFFR      = 0x0UL;
    eth.MACHTHR     = 0x0UL;
    eth.MACHTLR     = 0x0UL;
    eth.MACMIIAR    = 0x0UL;
    eth.MACMIIDR    = 0x0UL;
    eth.MACFCR      = 0x0UL;
    eth.MACVLANTR   = 0x0UL;
    for (uint32_t k = 0UL; k < 2UL; ++k)
    {
        eth.RESERVED0[k] = 0x0UL;
    }
    eth.MACRWUFFR   = 0x0UL;
    eth.MACPMTCSR   = 0x0UL;
    eth.RESERVED1   = 0x0UL;
    eth.MACDBGR     = 0x0UL;
    eth.MACSR       = 0x0UL;
    eth.MACIMR      = 0x0UL;
    eth.MACA0HR     = 0x8000FFFFUL;
    eth.MACA0LR     = 0xFFFFFFFFUL;
    eth.MACA1HR     = 0xFFFFUL;
    eth.MACA1LR     = 0xFFFFFFFFUL;
    eth.MACA2HR     = 0xFFFFUL;
    eth.MACA2LR     = 0xFFFFFFFFUL;
    eth.MACA3HR     = 0xFFFFUL;
    eth.MACA3LR     = 0xFFFFFFFFUL;
    for (uint32_t k = 0UL; k < 40UL; ++k)
    {
        eth.RESERVED2[k] = 0x0UL;
    }
    eth.MMCCR       = 0x0UL;
    eth.MMCRIR      = 0x0UL;
    eth.MMCTIR      = 0x0UL;
    eth.MMCRIMR     = 0x0UL;
    eth.MMCTIMR     = 0x0UL;
    for (uint32_t k = 0UL; k < 14UL; ++k)
    {
        eth.RESERVED3[k] = 0x0UL;
    }
    eth.MMCTGFSCCR  = 0x0UL;
    eth.MMCTGFMSCCR = 0x0UL;
    for (uint32_t k = 0UL; k < 5UL; ++k)
    {
        eth.RESERVED4[k] = 0x0UL;
    }
    eth.MMCTGFCR    = 0x0UL;
    for (uint32_t k = 0UL; k < 10UL; ++k)
    {
        eth.RESERVED5[k] = 0x0UL;
    }
    eth.MMCRFCECR   = 0x0UL;
    eth.MMCRFAECR   = 0x0UL;
    for (uint32_t k = 0UL; k < 10UL; ++k)
    {
        eth.RESERVED6[k] = 0x0UL;
    }
    eth.MMCRGUFCR   = 0x0UL;
    for (uint32_t k = 0UL; k < 334UL; ++k)
    {
        eth.RESERVED7[k] = 0x0UL;
    }
    eth.PTPTSCR     = 0x2000UL;
    eth.PTPSSIR     = 0x0UL;
    eth.PTPTSHR     = 0x0UL;
    eth.PTPTSLR     = 0x0UL;
    eth.PTPTSHUR    = 0x0UL;
    eth.PTPTSLUR    = 0x0UL;
    eth.PTPTSAR     = 0x0UL;
    eth.PTPTTHR     = 0x0UL;
    eth.PTPTTLR     = 0x0UL;
    eth.RESERVED8   = 0x0UL;
    eth.PTPTSSR     = 0x0UL;
    for (uint32_t k = 0UL; k < 565UL; ++k)
    {
        eth.RESERVED9[k] = 0x0UL;
    }
    eth.DMABMR      = 0x20101UL;
    eth.DMATPDR     = 0x0UL;
    eth.DMARPDR     = 0x0UL;
    eth.DMARDLAR    = 0x0UL;
    eth.DMATDLAR    = 0x0UL;
    eth.DMASR       = 0x0UL;
    eth.DMAOMR      = 0x0UL;
    eth.DMAIER      = 0x0UL;
    eth.DMAMFBOCR   = 0x0UL;
    eth.DMARSWTR    = 0x0UL;
    for (uint32_t k = 0UL; k < 8UL; ++k)
    {
        eth.RESERVED10[k] = 0x0UL;
    }
    eth.DMACHTDR    = 0x0UL;
    eth.DMACHRDR    = 0x0UL;
    eth.DMACHTBAR   = 0x0UL;
    eth.DMACHRBAR   = 0x0UL;
    return;
}

void InitDma2dRegisters(void)
{
    dma2d.CR        = 0x0UL;
    dma2d.ISR       = 0x0UL;
    dma2d.IFCR      = 0x0UL;
    dma2d.FGMAR     = 0x0UL;
    dma2d.FGOR      = 0x0UL;
    dma2d.BGMAR     = 0x0UL;
    dma2d.BGOR      = 0x0UL;
    dma2d.FGPFCCR   = 0x0UL;
    dma2d.FGCOLR    = 0x0UL;
    dma2d.BGPFCCR   = 0x0UL;
    dma2d.BGCOLR    = 0x0UL;
    dma2d.FGCMAR    = 0x0UL;
    dma2d.BGCMAR    = 0x0UL;
    dma2d.OPFCCR    = 0x0UL;
    dma2d.OCOLR     = 0x0UL;
    dma2d.OMAR      = 0x0UL;
    dma2d.OOR       = 0x0UL;
    dma2d.NLR       = 0x0UL;
    dma2d.LWR       = 0x0UL;
    dma2d.AMTCR     = 0x0UL;
    for (uint32_t k = 0UL; k < 236UL; ++k)
    {
        dma2d.RESERVED[k] = 0x0UL;
    }
    for (uint32_t k = 0UL; k < 256UL; ++k)
    {
        dma2d.FGCLUT[k] = 0x0UL;
        dma2d.BGCLUT[k] = 0x0UL;
    }
    return;
}

void InitDcmiRegisters(void)
{
    dcmi.CR         = 0x0UL;
    dcmi.SR         = 0x0UL;
    dcmi.RISR       = 0x0UL;
    dcmi.IER        = 0x0UL;
    dcmi.MISR       = 0x0UL;
    dcmi.ICR        = 0x0UL;
    dcmi.ESCR       = 0x0UL;
    dcmi.ESUR       = 0x0UL;
    dcmi.CWSTRTR    = 0x0UL;
    dcmi.CWSIZER    = 0x0UL;
    dcmi.DR         = 0x0UL;
    return;
}

void InitRngRegisters(void)
{
    rng.CR = 0x0UL;
    rng.SR = 0x0UL;
    rng.DR = 0x0UL;
    return;
}

void InitFmcRegisters(void)
{
    for (uint32_t k = 0UL; k < 8UL; ++k)
    {
        if (k == 0UL)
        {
            fmcBank1.BTCR[k] = 0x30DBUL;
        }
        else if (k < 4UL)
        {
            fmcBank1.BTCR[k] = 0x30D2UL;
        }
        else
        {
            fmcBank1.BTCR[k] = 0xFFFFFFFUL;
        }
    }

    for (uint32_t k = 0UL; k < 7UL; ++k)
    {
        fmcBank1E.BWTR[k] = 0xFFFFFFFUL;
    }

    fmcBank2_3.PCR2         = 0x18UL;
    fmcBank2_3.SR2          = 0x40UL;
    fmcBank2_3.PMEM2        = 0xFCFCFCFCUL;
    fmcBank2_3.PATT2        = 0xFCFCFCFCUL;
    fmcBank2_3.RESERVED0    = 0x0UL;
    fmcBank2_3.ECCR2        = 0x0UL;
    fmcBank2_3.RESERVED1    = 0x0UL;
    fmcBank2_3.RESERVED2    = 0x0UL;
    fmcBank2_3.PCR3         = 0x18UL;
    fmcBank2_3.SR3          = 0x40UL;
    fmcBank2_3.PMEM3        = 0xFCFCFCFCUL;
    fmcBank2_3.PATT3        = 0xFCFCFCFCUL;
    fmcBank2_3.RESERVED3    = 0x0UL;
    fmcBank2_3.ECCR3        = 0x0UL;
    
    fmcBank4.PCR4   = 0x18UL;
    fmcBank4.SR4    = 0x40UL;
    fmcBank4.PMEM4  = 0xFCFCFCFCUL;
    fmcBank4.PATT4  = 0xFCFCFCFCUL;
    fmcBank4.PIO4   = 0xFCFCFCFCUL;
    
    for (uint32_t k = 0UL; k < 2UL; ++k)
    {
        fmcBank5_6.SDCR[k] = 0x2D0UL;
        fmcBank5_6.SDTR[k] = 0xFFFFFFFUL;
    }
    fmcBank5_6.SDCMR    = 0x0UL;
    fmcBank5_6.SDRTR    = 0x0UL;
    fmcBank5_6.SDSR     = 0x0UL;
    
    return;
}

void InitDbgMcuRegisters(void)
{
    dbgMcu.IDCODE   = 0x0UL;
    dbgMcu.CR       = 0x0UL;
    dbgMcu.APB1FZ   = 0x0UL;
    dbgMcu.APB2FZ   = 0x0UL;
    return;
}

