JuhoL/ASch/Hal_STM32F429ZI/mocks/stm32f429xx_mock.cpp
void InitUsbRegisters(void)
{
    for (uint32_t i = 0UL; i < usbsMax; ++i)
    {
        usbs[i].GOTGCTL             = 0x10000UL;
        usbs[i].GOTGINT             = 0x0UL;
        usbs[i].GAHBCFG             = 0x0UL;
        usbs[i].GUSBCFG             = 0x1440UL;
        usbs[i].GRSTCTL             = 0x80000000UL;
        usbs[i].GINTSTS             = 0x4000020UL;
        usbs[i].GINTMSK             = 0x0UL;
        usbs[i].GRXSTSR             = 0x0UL;
        usbs[i].GRXSTSP             = 0x0UL;
        usbs[i].GRXFSIZ             = 0x200UL;
        usbs[i].DIEPTXF0_HNPTXFSIZ  = 0x200UL;
        usbs[i].HNPTXSTS            = 0x80200UL;
        for (uint32_t k = 0UL; k < 2UL; ++k)
        {
            usbs[i].Reserved30[k]   = 0x0UL;
        }
        usbs[i].GCCFG               = 0x0UL;
        usbs[i].CID                 = 0x1200UL;
        for (uint32_t k = 0UL; k < 48UL; ++k)
        {
            usbs[i].Reserved40[k]   = 0x0UL;
        }
        usbs[i].HPTXFSIZ            = 0x2000400UL;
        for (uint32_t k = 0UL; k < 0xFUL; ++k)
        {
            usbs[i].DIEPTXF[k]      = 0x2000200UL;
        }
    }
    return;
}

void InitScnScbRegisters(void)
{
    scnScb.RESERVED0[0] = 0x0UL;
    scnScb.ICTR         = 0x0UL;
    scnScb.ACTLR        = 0x0UL;
    return;
}

void InitScbRegisters(void)
{
    scb.CPUID       = 0x0UL;
    scb.ICSR        = 0x0UL;
    scb.VTOR        = 0x0UL;
    scb.AIRCR       = 0x0UL;
    scb.SCR         = 0x0UL;
    scb.CCR         = 0x0UL;
    for (uint32_t k = 0UL; k < 12UL; ++k)
    {
        scb.SHP[k]  = 0x0UL;
    }
    scb.SHCSR       = 0x0UL;
    scb.CFSR        = 0x0UL;
    scb.HFSR        = 0x0UL;
    scb.DFSR        = 0x0UL;
    scb.MMFAR       = 0x0UL;
    scb.BFAR        = 0x0UL;
    scb.AFSR        = 0x0UL;
    for (uint32_t k = 0UL; k < 2UL; ++k)
    {
        scb.PFR[k]  = 0x0UL;
    }
    scb.DFR         = 0x0UL;
    scb.ADR         = 0x0UL;
    for (uint32_t k = 0UL; k < 4UL; ++k)
    {
        scb.MMFR[k] = 0x0UL;
    }
    for (uint32_t k = 0UL; k < 5UL; ++k)
    {
        scb.ISAR[k] = 0x0UL;
    }
    for (uint32_t k = 0UL; k < 5UL; ++k)
    {
        scb.RESERVED0[k] = 0x0UL;
    }
    scb.CPACR       = 0x0UL;
    return;
}

void InitSysTickRegisters(void)
{
    sysTick.CTRL    = 0x0UL;
    sysTick.LOAD    = 0x0UL;
    sysTick.VAL     = 0x0UL;
    sysTick.CALIB   = 0x0UL;
    return;
}

void InitNvicRegisters(void)
{
    for (uint32_t k = 0UL; k < 8UL; ++k)
    {
        nvic.ISER[k] = 0x0UL;
        nvic.ICER[k] = 0x0UL;
        nvic.ISPR[k] = 0x0UL;
        nvic.ICPR[k] = 0x0UL;
        nvic.IABR[k] = 0x0UL;
    }
    for (uint32_t k = 0UL; k < 240UL; ++k)
    {
        nvic.IP[k] = 0x0UL;
    }
    
    for (uint32_t k = 0UL; k < 24UL; ++k)
    {
        nvic.RESERVED0[k] = 0x0UL;
        nvic.RSERVED1[k]  = 0x0UL;
        nvic.RESERVED2[k] = 0x0UL;
        nvic.RESERVED3[k] = 0x0UL;
    }
    for (uint32_t k = 0UL; k < 56UL; ++k)
    {
        nvic.RESERVED4[k]   = 0x0UL;
    }
    for (uint32_t k = 0UL; k < 644UL; ++k)
    {
        nvic.RESERVED5[k]   = 0x0UL;
    }
    nvic.STIR = 0x0UL;
    return;
}

void InitItmRegisters(void)
{
    for (uint32_t k = 0UL; k < 32UL; ++k)
    {
        itm.PORT[k].u32 = 0x0UL;
    }
    for (uint32_t k = 0UL; k < 864UL; ++k)
    {
        itm.RESERVED0[k] = 0x0UL;
    }
    itm.TER         = 0x0UL;
    for (uint32_t k = 0UL; k < 15UL; ++k)
    {
        itm.RESERVED1[k] = 0x0UL;
    }
    itm.TPR         = 0x0UL;
    for (uint32_t k = 0UL; k < 15UL; ++k)
    {
        itm.RESERVED2[k] = 0x0UL;
    }
    itm.TCR         = 0x0UL;
    for (uint32_t k = 0UL; k < 29UL; ++k)
    {
        itm.RESERVED3[k] = 0x0UL;
    }
    itm.IWR         = 0x0UL;
    itm.IRR         = 0x0UL;
    itm.IMCR        = 0x0UL;
    for (uint32_t k = 0UL; k < 43UL; ++k)
    {
        itm.RESERVED4[k] = 0x0UL;
    }
    itm.LAR         = 0x0UL;
    itm.LSR         = 0x0UL;
    for (uint32_t k = 0UL; k < 6UL; ++k)
    {
        itm.RESERVED5[k] = 0x0UL;
    }
    itm.PID4        = 0x0UL;
    itm.PID5        = 0x0UL;
    itm.PID6        = 0x0UL;
    itm.PID7        = 0x0UL;
    itm.PID0        = 0x0UL;
    itm.PID1        = 0x0UL;
    itm.PID2        = 0x0UL;
    itm.PID3        = 0x0UL;
    itm.CID0        = 0x0UL;
    itm.CID1        = 0x0UL;
    itm.CID2        = 0x0UL;
    itm.CID3        = 0x0UL;
    return;
}

void InitDwtRegisters(void)
{
    dwt.CTRL            = 0x0UL;
    dwt.CYCCNT          = 0x0UL;
    dwt.CPICNT          = 0x0UL;
    dwt.EXCCNT          = 0x0UL;
    dwt.SLEEPCNT        = 0x0UL;
    dwt.LSUCNT          = 0x0UL;
    dwt.FOLDCNT         = 0x0UL;
    dwt.PCSR            = 0x0UL;
    dwt.COMP0           = 0x0UL;
    dwt.MASK0           = 0x0UL;
    dwt.FUNCTION0       = 0x0UL;
    dwt.RESERVED0[0]    = 0x0UL;
    dwt.COMP1           = 0x0UL;
    dwt.MASK1           = 0x0UL;
    dwt.FUNCTION1       = 0x0UL;
    dwt.RESERVED1[0]    = 0x0UL;
    dwt.COMP2           = 0x0UL;
    dwt.MASK2           = 0x0UL;
    dwt.FUNCTION2       = 0x0UL;
    dwt.RESERVED2[0]    = 0x0UL;
    dwt.COMP3           = 0x0UL;
    dwt.MASK3           = 0x0UL;
    dwt.FUNCTION3       = 0x0UL;
    return;
}

void InitTpiRegisters(void)
{
    tpi.SSPSR           = 0x0UL;
    tpi.CSPSR           = 0x0UL;
    for (uint32_t k = 0UL; k < 2UL; ++k)
    {
        tpi.RESERVED0[k] = 0x0UL;
    }
    tpi.ACPR            = 0x0UL;
    for (uint32_t k = 0UL; k < 55UL; ++k)
    {
        tpi.RESERVED1[k] = 0x0UL;
    }
    tpi.SPPR        = 0x0UL;
    for (uint32_t k = 0UL; k < 131UL; ++k)
    {
        tpi.RESERVED2[k] = 0x0UL;
    }
    tpi.FFSR            = 0x0UL;
    tpi.FFCR            = 0x0UL;
    tpi.FSCR            = 0x0UL;
    for (uint32_t k = 0UL; k < 759UL; ++k)
    {
        tpi.RESERVED3[k] = 0x0UL;
    }
    tpi.TRIGGER         = 0x0UL;
    tpi.FIFO0           = 0x0UL;
    tpi.ITATBCTR2       = 0x0UL;
    tpi.RESERVED4[0]    = 0x0UL;
    tpi.ITATBCTR0       = 0x0UL;
    tpi.FIFO1           = 0x0UL;
    tpi.ITCTRL          = 0x0UL;
    for (uint32_t k = 0UL; k < 39UL; ++k)
    {
        tpi.RESERVED5[k] = 0x0UL;
    }
    tpi.CLAIMSET        = 0x0UL;
    tpi.CLAIMCLR        = 0x0UL;
    for (uint32_t k = 0UL; k < 8UL; ++k)
    {
        tpi.RESERVED7[k] = 0x0UL;
    }
    tpi.DEVID           = 0x0UL;
    tpi.DEVTYPE         = 0x0UL;
    return;
}

void InitCoreDebugRegisters(void)
{
    coreDebug.DHCSR = 0x0UL;
    coreDebug.DCRSR = 0x0UL;
    coreDebug.DCRDR = 0x0UL;
    coreDebug.DEMCR = 0x0UL;
    return;
}

void InitMpuRegisters(void)
{
    mpu.TYPE    = 0x0UL;
    mpu.CTRL    = 0x0UL;
    mpu.RNR     = 0x0UL;
    mpu.RBAR    = 0x0UL;
    mpu.RASR    = 0x0UL;
    mpu.RBAR_A1 = 0x0UL;
    mpu.RASR_A1 = 0x0UL;
    mpu.RBAR_A2 = 0x0UL;
    mpu.RASR_A2 = 0x0UL;
    mpu.RBAR_A3 = 0x0UL;
    mpu.RASR_A3 = 0x0UL;
    return;
}

void InitFpuRegisters(void)
{
    fpu.RESERVED0[0]    = 0x0UL;
    fpu.FPCCR           = 0x0UL;
    fpu.FPCAR           = 0x0UL;
    fpu.FPDSCR          = 0x0UL;
    fpu.MVFR0           = 0x0UL;
    fpu.MVFR1           = 0x0UL;
    return;
}

} // namespace Hal_Mock
